In [5]:
import pandas as pd

In [6]:
# import pandas library
details = {
	0 : {
		'Name' : 'Hemanth',
		'Age' : 27,
		'University' : 'JNTU'
		},
	1 : {
		'Name' : 'Aishwarya',
		'Age' : 21,
		'University' : 'JNU'
		},
	2 : {
		'Name' : 'Shaurya',
		'Age' : 23,
		'University' : 'TU'
		},
 	3 : {
		'Name' : 'Hemanth Kumar',
		'Age' : 27,
		'University' : 'JNTU'
		},
}

# creating a Dataframe object
# from nested dictionary
# in which inside dictionary
# key is act as index value
# and column value is 0, 1, 2...
df = pd.DataFrame(details)

# swap the columns with indexes
df = df.transpose()
print(df)

            Name Age University
0        Hemanth  27       JNTU
1      Aishwarya  21        JNU
2        Shaurya  23         TU
3  Hemanth Kumar  27       JNTU

In [4]:
# Single selections using iloc and DataFrame
# Rows:
df.iloc[0] # first row of data frame

Name          Hemanth
Age                27
University       JNTU
Name: 0, dtype: object

In [7]:
df.iloc[:,0]

0          Hemanth
1        Aishwarya
2          Shaurya
3    Hemanth Kumar
Name: Name, dtype: object

In [8]:
df.iloc[:,-1]

0    JNTU
1     JNU
2      TU
3    JNTU
Name: University, dtype: object

In [10]:
df.iloc[:,-1].unique

<bound method Series.unique of 0    JNTU
1     JNU
2      TU
3    JNTU
Name: University, dtype: object>

In [13]:
df.iloc[:,-1]

0    JNTU
1     JNU
2      TU
3    JNTU
Name: University, dtype: object

In [21]:
df.loc[df['Name'] == 'Hemanth']

      Name Age University
0  Hemanth  27       JNTU